Repository: AndreNascimentoCosta/GroupUp
Catalog: lib/l10n/app_*.arb
Languages: pt

# generalError
source: Something went wrong
pt: Algo deu errado

# createHS
source: Create
pt: Crie

# orHS
source: or
pt: ou

# joinHS
source: Join
pt: Entre

# groupHS
source: a group then
pt: em um grupo e

# challengeHS
source: Challenge!
pt: Desafie!

source: Get started
pt: Comece aqui

# continueApple
source: Continue with Apple
pt: Continuar com Apple

# continueGoogle
source: Continue with Google
pt: Continuar com Google

# continuePhoneNumber
source: Continue with phone number
pt: Continuar com telefone

# continuePN
source: Continue
pt: Continuar

source: Phone number
pt: Número de telefone

source: Verification code
pt: Código de verificação

source: Next
pt: Próximo

# codeSent
source: Code is sent to {phoneControllerText}
pt: Código enviado para {phoneControllerText}

# codeNotReceived
source: Didn't receive a code?
pt: Não recebeu o código?

# waitingRequestAgain
source: Request in {phoneProviderStart} sec
pt: Solicite em {phoneProviderStart} seg

source: Request again
pt: Solicite de novo

source: Error
pt: Erro

source: Search country
pt: Procure um país

source: Invalid phone number
pt: Número de telefone inválido

# tooManyRequests
source: Too many requests, try again later
pt: Muito pedidos, tente de novo mais tarde

source: Invalid verification code
pt: Código de verificação inválido

source: Name
pt: Nome

# nameValidatorAtLeast3Chars
source: Name must be at least 3 characters
pt: Nome precisa ter pelo menos 3 caracteres

# enterName
source: Enter your name
pt: Digite seu nome

source: Groups
pt: Grupos

source: Select all
pt: Selecione todos

source: Pin
pt: Fixar

source: Delete
pt: Deletar

source: Ended
pt: Finalizado

source: #NewGroup
pt: #NovoGrupo

source: Create or join a group
pt: Crie ou entre em um grupo

source: Join a group
pt: Entre em um grupo

# createNewGroup
source: Create a new group
pt: Crie um novo grupo

source: Please enter group code
pt: Por favor, digite o código do grupo

source: Group code
pt: Código do grupo

source: Enter group code
pt: Digite o código do grupo

# feeNotRefundable
source: If group has a fee, this fee is non-refundable
pt: Se o grupo tiver uma taxa, essa taxa não é reembolsável.

source: Invalid group code
pt: Código do group inválido

# groupAlreadyEnded
source: This group has already ended
pt: Esse grupo já finalizou

# groupAlreadyFull
source: This group is already full
pt: Esse grupo já está cheio

# userAlreadyInTheGroup
source: You are already in this group
pt: Você já está nesse grupo

# createGroup
source: Create a group
pt: Crie um grupo

source: Project name
pt: Nome do grupo

# projectNameValidatorMinChars
source: Project name must be at least 3 characters
pt: Nome do grupo deve conter pelo menos 3 caracteres

# projectNameValidatorMaxChars
source: Project name must be less than 20 characters
pt: Nome do group deve conter no máximo 20 caracteres

source: Enter project name
pt: Digite o nome do grupo

source: Objective
pt: Objetivo

# objectiveValidatorMinChars
source: Objective must be at least 3 characters
pt: Objetivo deve conter pelo menos 3 caracteres

# objectiveValidatorMaxChars
source: Objective must be less than 50 characters
pt: Objetivo deve conter no máximo 50 caracteres

source: Enter objective
pt: Digite o objetivo

source: Currency
pt: Moeda

source: Search
pt: Buscar

# feeGreaterThan
source: Fee must be greater than {minValueCurrencies}
pt: Taxa deve ser maior que {minValueCurrencies}

source: Group fee
pt: Taxa do grupo

# groupDescriptionPaymentOn
source: 1. For the moment, the fee can only be paid in Brazilian Real, so make sure you can pay in that currency. 2. The fee can be set to 0 and there will be no group reward. 3. Each participant will pay the fee and the total amount will be used as the group reward. 4. The fee is non-refundable. 5. The dates and number of participants cannot be edited once a data has been added by a participant.
pt: 1. No momento, a taxa pode apenas ser paga em real brasileiro, então certifique-se de que você pode pagar nessa moeda. 2. A taxa pode ser 0 e não haverá recompensa no grupo. 3. Cada participante terá que pagar a taxa e a soma total será usada como a recompensa do grupo. 4. A taxa não é reembolsável. 5. As datas e o número de participantes não poderão ser editados quando um dado for adicionado por um participante.

# groupDescription
source: 1. The dates and number of participants cannot be edited once a data has been added by a participant.
pt: 1. As datas e o número de participantes não poderão ser editados quando um dado for adicionado por um participante.

# maxParticipants
source: Maximum of 50 participants.
pt: 50 participantes no máximo

# numberParticipants
source: Number of participants
pt: Número de participantes

# enterNumber
source: Enter a number
pt: Digite um número

# numberParticipantsValidatorMaxParticipants
source: Number of participants cannot exceed 50
pt: Número de participantes não pode ser maior que 50

source: Dates
pt: Datas

# everyoneCanEditGroupPic
source: Everyone can edit group picture
pt: Todos podem editar foto do grupo

# numberParticipantsValidatorMinParticipants
source: Number of participants must be at least 1
pt: Número de participantes deve ser pelo menos 1

# numberParticipantsValidatorMinParticipantsAfterGroupCreated
source: Number of participants must be at least {participantsLength}
pt: Número de participantes deve ser pelo menos {participantsLength}

source: Select date
pt: Escolha a data

source: Select both dates
pt: Escolha as duas datas

# endDateMustBeAfterStartDate
source: Must be the same or after the start date
pt: Precisa ser no mesmo ou depois do dia de início

source: Start date
pt: Início

source: End date
pt: Fim

source: Confirm
pt: Confirmar

# confirmCreateGroup
source: Are you sure you want to create a group?
pt: Tem certeza que quer criar o grupo?

source: Yes
pt: Sim

source: No
pt: Não

# confirmExitGroup
source: Are you sure you want to leave the group?
pt: Tem certeza que quer sair do grupo?

# confirmDeleteAccount
source: Are you sure you want to delete your account?
pt: Tem certeza que quer excluir sua conta?

source: Profile
pt: Perfil

source: Balance
pt: Saldo

source: Created groups
pt: Grupos criados

source: Edit profile
pt: Editar perfil

# reportProblem
source: Report a problem
pt: Reportar problema

source: Privacy policy
pt: Política de privacidade

source: Delete account
pt: Excluir conta

source: Log out
pt: Sair da conta

source: Choose from gallery
pt: Escolha da galeria

# takePhoto
source: Take a photo
pt: Tire uma foto

source: Done
pt: Feito

# nameValidatorMinChars
source: Name must be at least 3 characters
pt: Nome deve conter pelo menos 3 caracteres

# nameValidatorMaxChars
source: Name must be less than 30 characters
pt: Nome deve conter no máximo 30 caracteres

source: No created groups
pt: Sem grupos criados

source: Total balance
pt: Saldo total

source: Add
pt: Adicionar

source: Withdraw
pt: Sacar

source: Ongoing
pt: Em andamento

source: Start
pt: Início

source: End
pt: Fim

source: Me
pt: Eu

source: Reward
pt: Recompensa

# rewardValidatorMinChars
source: Reward must be at least 3 characteres
pt: Recompensa deve conter pelo menos 3 caracteres

# rewardValidatorMaxChars
source: Reward must be less than 50 characters
pt: Recompensa deve conter no máximo 50 caracteres

source: Change group reward
pt: Mude a recompensa do grupo

# dataValidated
source: Done! You validated this data!
pt: Pronto! Você validou esse dado!

# dataInvalidated
source: Done! You invalidated this data!
pt: Pronto! Você invalidou esse dado!

source: Group ended
pt: Grupo finalizado

# winnerWonPayment
source: The winner won {groupCurrencySymbol} {groupReward}
pt: O vencedor ganhou {groupCurrencySymbol} {groupReward}

# winnerWon
source: The winner won {groupReward}
pt: O vencedor ganhou {groupReward}

source: You can't do this
pt: Você não pode fazer isso

# cantAddDataWhenNotEveryoneHasJoined
source: To add data, you have to wait for everyone to join the group.
pt: Você não pode adicionar dados enquanto todos os participantes não entraram ainda

source: Data
pt: Dados

# dataAddData
source: Data:
pt: Dado:

# dateAddData
source: Date:
pt: Data:

source: Enter data
pt: Digite os dados

# dataValidatorMaxNum
source: Data must be less than 99999
pt: O valor máximo é 99999

source: Data history
pt: Histórico de dados

source: Values
pt: Valores

source: Group settings
pt: Configurações

source: Report participant
pt: Reportar participante

# cantChangeDatesWhenParticipantAddedData
source: A participant has already added data. You can't change the dates anymore.
pt: Você não pode mudar as datas depois que um participante adicionou um dado

# cantChangeNumberParticipantsWhenParticipantAddedData
source: A participant has already added data. You can't change the number of participants anymore.
pt: Você não pode mudar o número de participantes depois que um participante adicionou um dado

# shareGroupCodeText
source: Join my group {groupsProjectName} on GroupUp! The code is {groupsGroupCode}
pt: Entre no meu grupo {groupsProjectName} no GroupUp! O código é {groupsGroupCode}

source: Exit group
pt: Sair do grupo

source: Change group dates
pt: Mudar datas do grupo

source: Participants
pt: Participantes

# changeNumberParticipants
source: Change number of participants
pt: Mudar número de participantes

source: Group objective
pt: Objetivo do grupo

source: Change group objective
pt: Mudar objetivo do grupo

source: Group name
pt: Nome do grupo

source: Change group name
pt: Mudar nome do grupo

# mailReportParticipant
source: subject=Report a problem&body=I would like to report {participantName} ({participantUid}) from the group {groupProjectName} ({groupId}) for the following reason:
pt: subject=Reportar um problema&body=Eu gostaria de reportar o participante {participantName} ({participantUid}) do grupo {groupProjectName} ({groupId}) pela seguinte razão:

# infoReportParticipant
source: Info: If a participant is reported by majority, after the report is analysed and approved, this person will be removed from the group (This only works when there are at least 3 participants in the group.)
pt: Info: Se um participante é reportado pela maioria, depois que for analisado e aprovado, essa pessoa será removida do grupo (Só funciona se tiver pelo menos 3 pessoas no grupo.)

# addMedia
source: Add photo or video
pt: Adicionar mídia

# validateMediaText
source: Validate your data by adding a media. If the majority of the group validates, your data will be taken into account.
pt: Valide seu dado adicionando uma mídia. Se a maioria do grupo validar, seu dado será levado em consideração.

source: Cancel
pt: Cancelar

# discardChangesQuestion
source: Discard changes?
pt: Descartar alterações?

# areYouSureToDiscardChanges
source: Are you sure you want to lose your changes?
pt: Tem certeza que quer descartar as alterações?

source: Yes, discard
pt: Sim, descartar

source: No, keep
pt: Não, manter

# choosePicture
source: Choose a picture
pt: Escolha uma foto

source: None
pt: Nenhum

source: Completed
pt: Concluído

source: Create Connected account
pt: Criar conta conectada

# createConnectedAccountText
source: Create an account, fill the form and add your bank account to receive payouts.
pt: Crie uma conta conectada, preencha o formulário e adicione sua conta do banco para receber pagamentos.

source: Create account
pt: Criar conta

source: Connected account
pt: Conta conectada

# chooseOption
source: Choose an option
pt: Escolha uma opção

source: Login to your Connected account
pt: Entre na conta conectada

# loginToYourConnectedAccountText
source: Are you sure you want to login to your Connected account? You will be redirected to a new page
pt: Tem certeza que quer entrar na sua conta? Você será redirecionado para uma nova página

source: Delete Connected account
pt: Excluir conta conectada

# deleteConnectedAccountText
source: Are you sure you want to delete your Connected account?
pt: Tem certeza que quer excluir sua conta conectada?

# requestPayout
source: Request a payout
pt: Solicitar um pagamento

# requestPayoutText
source: Are you sure you want to request a payout? All the money in your balance will be sent to your bank account of your connected account within one business day.
pt: Tem certeza que quer solicitar um pagamento? Todo o dinheiro do seu saldo será enviado para sua conta do banco da sua conta conectada em até um dia útil.

# connectedAccountDeleted
source: Your Connected account has been deleted.
pt: Conta conectada excluída

source: Resume account creation
pt: Continuar a criação da conta

source: Redirecting...
pt: Redirecionando...

source: Options
pt: Opções

# balanceZero
source: Your balance is 0
pt: Seu saldo é 0

source: Tiebreaker
pt: Desempate

# tieBreakerText
source: The group ended in a draw. The participants who tied have one day to break the tie by adding data. The data will go through the validation process. If none data is added, the participant who joined the group first will be the winner.
pt: O grupo terminou empatado. Os participantes que empataram tem um dia para desempatar adicionado dados. Os dados passarão pelo processo de validação. Se nenhum dado for adicionado, o participante que entro primeiro no grupo será o ganhador.

source: Saved cards
pt: Cartões salvos

source: No saved cards
pt: Sem cartões salvos

source: Exp. date
pt: Validade

# confirmCard
source: Are you sure you want pay with this card?
pt: Tem certeza de que deseja pagar com este cartão?

source: Start - End date
pt: Data de Início - Fim

# paymentInterrupted
source: Payment interrupted, try again
pt: Pagamento interrompido, tente de novo

source: Important
pt: Importante

# allowPhotoAccess
source: You need to allow photo access
pt: Você precisa permitir o acesso às fotos

# failedPickImage
source: Failed to pick image
pt: Falha ao escolher a imagem

source: No participants
pt: Sem participantes

# cantAddDataInValidationPeriod
source: You can't add data during the validation period
pt: Você não pode adicionar dados no período de validação

source: Claim reward
pt: Resgatar recompensa

source: Reward already claimed
pt: Recompensa já resgatada

# rewardClaimedText
source: Your reward has been claimed
pt: Sua recompensa foi resgatada

# payoutSuccessful
source: Payout made successfully, login to your Connected account to see the details.
pt: Pagamento bem sucedido, entre na sua conta conectada para ver detalhes.

source: Enter reward
pt: Digite a recompensa

source: Update
pt: Atualizar

# updateText
source: A new version of GroupUp is available. Please update to continue using the app.
pt: Uma nova versão do GroupUp está disponível. Por favor, atualize o aplicativo para continuar usando.

source: No data
pt: Sem dados

# createOrJoinAGroupOnboardingText
source: You can join an existing group or create one by setting an objective and reward
pt: Você pode entrar em um grupo existente ou criar um definindo um objetivo e uma recompensa

# addDataAndPhotoOnboarding
source: Track your progress with data and photos
pt: Acompanhe seu progresso com dados e fotos

# addDataAndPhotoOnboardingText
source: Once you're in a group, submit your data and photos as proof of your progress
pt: Quando estiver em um grupo, envie seus dados e fotos como prova de seu progresso

# validateDataOnboarding
source: Validate your friends' progress
pt: Valide os dados de seus amigos

# validateDataOnboardingText
source: Review their data, and determine whether or not the photo provided is a good representation of the data submitted
pt: Revise seus dados e determine se a foto fornecida é ou não uma boa representação dos dados enviados

# winRewardOnboarding
source: Win the reward
pt: Ganhe a recompensa

# winRewardOnboardingText
source: The user with the highest value at the end of the challenge will be the winner and will receive the reward
pt: O participante com o maior valor ao final do desafio será o vencedor e receberá a recompensa

source: Skip
pt: Pular
